"""
<print & 변수>
1. 출력하라고 명령하고 싶으면 print 를 씁니다

print(123)

이렇게 적으면 123이라는 숫자를 출력하라는 명령을 줄 수 있습니다.

실행해보면 진짜 123을 출력해줍니다. 이제 컴퓨터가 말 잘듣죠?

print는 그래서 원하는 데이터를 출력해보고싶을 때 쓰시면 됩니다.

소괄호 안에 원하는 자료를 담아주시면 됩니다.
파이썬에서 표현할 수 있는 자료는 숫자, 문자 이런 것들이 있습니다.

print('차은우')
print("차은우")

이렇게 따옴표 안에 적으면 문자데이터를 출력해볼 수 있습니다.
실은 문자 적을 땐 작은 따옴표, 큰 따옴표 둘다 가능합니다.

print(123 + 456)
print(100 * 100)

컴퓨터에게 사칙연산을 시키면 사칙연산 잘해줍니다.

2. 데이터가 너무 긴 경우 변수를 쓰자

친구 이름을 출력하고 싶은데 가끔은 친구 이름이 너무 길 수도 있습니다.

print('슈퍼 에이전트 하이퍼 초필살 드래곤')

나중에 이런 이름을 또 출력하고 싶으면 이걸 똑같이 쓰면 될텐데 너무 길어서 귀찮은겁니다.

그럴 때 변수라는 문법을 쓰시면 됩니다.

변수는 데이터를 잠깐 보관할 수 있는 통입니다.

변수를 만들고 싶으면 그냥 변수이름 = 담을데이터 라고 적으시면 됩니다.

예를 들어서 여러분의 긴 이름을 잠깐 변수로 저장하고 싶으면

풀네임 = '슈퍼 에이전트 하이퍼 초필살 드래곤'

print(풀네임)

▲ 이렇게 쓰면 풀네임이라는 이름으로 여러분의 긴 자료를 잠깐 저장가능합니다. (변수이름은 자유 작명 가능합니다)

그럼 이제 앞으로 풀네임이라고 쓰면 그 자리에 '슈퍼 에이전트 하이퍼 초필살 드래곤' 이게 남습니다.

"그냥 외우기 힘든 긴 자료를 짧은 단어로 치환해서쓸 때 좋다~" 라고 기억하셔도 좋습니다.

그럼 앞으로 필요하면 변수 만들어 쓰십시오.



"""